## Task 1 - Data Quality Assessment  

#### Data Quality Framework
1. Accuracy
2. Completeness
3. Consistency
4. Currency
5. Relevancy
6. Validity
7. Uniqueness

### 1. Import libraries

In [1]:
import pandas as pd

### 2. Load datasets

In [2]:
transaction_raw = pd.read_excel('G:/Ninh/Python/KPMG/Data Analytics/Task1/KPMG_VI_New_raw_data_update_final.xlsx',sheet_name='Transactions',skiprows=[0])

customer_demo_raw = pd.read_excel('G:/Ninh/Python/KPMG/Data Analytics/Task1/KPMG_VI_New_raw_data_update_final.xlsx',sheet_name='CustomerDemographic',skiprows=[0])

customer_add_raw = pd.read_excel('G:/Ninh/Python/KPMG/Data Analytics/Task1/KPMG_VI_New_raw_data_update_final.xlsx',sheet_name='CustomerAddress',skiprows=[0])

In [3]:
transaction_raw.head(3)

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
0,1,2,2950,2017-02-25,0.0,Approved,Solex,Standard,medium,medium,71.49,53.62,41245.0
1,2,3,3120,2017-05-21,1.0,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92,41701.0
2,3,37,402,2017-10-16,0.0,Approved,OHM Cycles,Standard,low,medium,1793.43,248.82,36361.0

In [4]:
customer_demo_raw.head(3)

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
0,1,Laraine,Medendorp,F,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,"""'",Yes,11.0
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,<script>alert('hi')</script>,Yes,16.0
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,2018-02-01 00:00:00,Yes,15.0

In [5]:
customer_add_raw.head(3)

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9

### 3. Explore each dataset

#### 3.1. Transaction data

In [6]:
transaction_raw.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           20000 non-null  int64
 1   product_id               20000 non-null  int64
 2   customer_id              20000 non-null  int64
 3   transaction_date         20000 non-null  datetime64[ns]
 4   online_order             19640 non-null  float64
 5   order_status             20000 non-null  object
 6   brand                    19803 non-null  object
 7   product_line             19803 non-null  object
 8   product_class            19803 non-null  object
 9   product_size             19803 non-null  object
 10  list_price               20000 non-null  float64
 11  standard_cost            19803 non-null  float64
 12  product_first_sold_date  19803 non-null  float64
dtypes: datetime64[ns](1), float64(4), int64(3), object(5)
memory usage: 2.0+ MB

In [7]:
transaction_raw.describe()

,transaction_id,product_id,customer_id,online_order,list_price,standard_cost,product_first_sold_date
count,20000.000000,20000.00000,20000.000000,19640.000000,20000.000000,19803.000000,19803.000000
mean,10000.500000,45.36465,1738.246050,0.500458,1107.829449,556.046951,38199.776549
std,5773.647028,30.75359,1011.951046,0.500013,582.825242,405.955660,2875.201110
min,1.000000,0.00000,1.000000,0.000000,12.010000,7.210000,33259.000000
25%,5000.750000,18.00000,857.750000,0.000000,575.270000,215.140000,35667.000000
50%,10000.500000,44.00000,1736.000000,1.000000,1163.890000,507.580000,38216.000000
75%,15000.250000,72.00000,2613.000000,1.000000,1635.300000,795.100000,40672.000000
max,20000.000000,100.00000,5034.000000,1.000000,2091.470000,1759.850000,42710.000000

In [8]:
transaction_raw.isnull().sum()/len(transaction_raw)*100

transaction_id             0.000
product_id                 0.000
customer_id                0.000
transaction_date           0.000
online_order               1.800
order_status               0.000
brand                      0.985
product_line               0.985
product_class              0.985
product_size               0.985
list_price                 0.000
standard_cost              0.985
product_first_sold_date    0.985
dtype: float64

In [9]:
transaction_raw_cate = transaction_raw.select_dtypes(include='object')
print('Unique values in categorical variables:','\n')
for i in transaction_raw_cate.columns:
    print(i,':',transaction_raw_cate[i].unique())

Unique values in categorical variables:

order_status : ['Approved' 'Cancelled']
brand : ['Solex' 'Trek Bicycles' 'OHM Cycles' 'Norco Bicycles' 'Giant Bicycles'
 'WeareA2B' nan]
product_line : ['Standard' 'Road' 'Mountain' 'Touring' nan]
product_class : ['medium' 'low' 'high' nan]
product_size : ['medium' 'large' 'small' nan]

In [10]:
print(transaction_raw['transaction_date'].min())
print(transaction_raw['transaction_date'].max())

2017-01-01 00:00:00
2017-12-30 00:00:00

In [11]:
#find duplicate values
transaction_raw[transaction_raw.duplicated()]

Empty DataFrame
Columns: [transaction_id, product_id, customer_id, transaction_date, online_order, order_status, brand, product_line, product_class, product_size, list_price, standard_cost, product_first_sold_date]
Index: []

In [12]:
#find duplicate values
transaction_raw[transaction_raw.duplicated(['transaction_id'])]

Empty DataFrame
Columns: [transaction_id, product_id, customer_id, transaction_date, online_order, order_status, brand, product_line, product_class, product_size, list_price, standard_cost, product_first_sold_date]
Index: []

In [13]:
#find duplicate values
transaction_raw['customer_id'].value_counts()

2183    14
1068    14
2476    14
2072    13
1672    13
        ..
2395     1
1569     1
1203     1
2271     1
1544     1
Name: customer_id, Length: 3494, dtype: int64

#### 3.2.  Customer demographic data

In [14]:
customer_demo_raw = customer_demo_raw.drop('default',axis=1)

In [15]:
customer_demo_raw.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 12 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          4000 non-null   int64
 1   first_name                           4000 non-null   object
 2   last_name                            3875 non-null   object
 3   gender                               4000 non-null   object
 4   past_3_years_bike_related_purchases  4000 non-null   int64
 5   DOB                                  3913 non-null   datetime64[ns]
 6   job_title                            3494 non-null   object
 7   job_industry_category                3344 non-null   object
 8   wealth_segment                       4000 non-null   object
 9   deceased_indicator                   4000 non-null   object
 10  owns_car                             4000 non-null   object
 11  tenure                               3913 non-null   float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(8)
memory usage: 375.1+ KB

In [16]:
customer_demo_raw.isnull().sum()/len(customer_demo_raw) *100

customer_id                             0.000
first_name                              0.000
last_name                               3.125
gender                                  0.000
past_3_years_bike_related_purchases     0.000
DOB                                     2.175
job_title                              12.650
job_industry_category                  16.400
wealth_segment                          0.000
deceased_indicator                      0.000
owns_car                                0.000
tenure                                  2.175
dtype: float64

In [17]:
customer_demo_raw_cate = customer_demo_raw.select_dtypes(include='object')
print(customer_demo_raw_cate.columns)
print('Unique values in categorical variables:','\n')
for i in customer_demo_raw_cate.columns:
    if len(customer_demo_raw[i].unique()) < 20:
        print(i,':',customer_demo_raw[i].unique())

Index(['first_name', 'last_name', 'gender', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'owns_car'],
      dtype='object')
Unique values in categorical variables:

gender : ['F' 'Male' 'Female' 'U' 'Femal' 'M']
job_industry_category : ['Health' 'Financial Services' 'Property' 'IT' nan 'Retail' 'Argiculture'
 'Manufacturing' 'Telecommunications' 'Entertainment']
wealth_segment : ['Mass Customer' 'Affluent Customer' 'High Net Worth']
deceased_indicator : ['N' 'Y']
owns_car : ['Yes' 'No']

In [18]:
print(customer_demo_raw['DOB'].min())
print(customer_demo_raw['DOB'].max())

1843-12-21 00:00:00
2002-03-11 00:00:00

In [19]:
customer_demo_raw[customer_demo_raw['DOB']=='1843-12-21 00:00:00']

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure
33,34,Jephthah,Bachmann,U,59,1843-12-21,Legal Assistant,IT,Affluent Customer,N,No,20.0

In [20]:
#find duplicate values
customer_demo_raw[customer_demo_raw.duplicated()]

Empty DataFrame
Columns: [customer_id, first_name, last_name, gender, past_3_years_bike_related_purchases, DOB, job_title, job_industry_category, wealth_segment, deceased_indicator, owns_car, tenure]
Index: []

In [21]:
customer_demo_raw['customer_id'].value_counts()

2047    1
657     1
2732    1
681     1
2728    1
       ..
3371    1
1322    1
3367    1
1318    1
2049    1
Name: customer_id, Length: 4000, dtype: int64

#### 3.3. Customer address data

In [22]:
customer_add_raw.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3999 entries, 0 to 3998
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   customer_id         3999 non-null   int64
 1   address             3999 non-null   object
 2   postcode            3999 non-null   int64
 3   state               3999 non-null   object
 4   country             3999 non-null   object
 5   property_valuation  3999 non-null   int64
dtypes: int64(3), object(3)
memory usage: 187.6+ KB

In [23]:
customer_add_raw_cate = customer_add_raw.select_dtypes(include='object')
print(customer_add_raw_cate.columns)
print('Unique values in categorical variables:','\n')
for i in customer_add_raw_cate.columns:
    if len(customer_add_raw[i].unique()) < 20:
        print(i,':',customer_add_raw[i].unique())

Index(['address', 'state', 'country'], dtype='object')
Unique values in categorical variables:

state : ['New South Wales' 'QLD' 'VIC' 'NSW' 'Victoria']
country : ['Australia']

In [24]:
#find duplicate values
customer_add_raw[customer_add_raw.duplicated()]

Empty DataFrame
Columns: [customer_id, address, postcode, state, country, property_valuation]
Index: []

In [25]:
customer_add_raw['customer_id'].value_counts()

2047    1
653     1
2728    1
677     1
2724    1
       ..
3371    1
1322    1
3367    1
1318    1
2049    1
Name: customer_id, Length: 3999, dtype: int64